Config.org
#+TITLE: Arkomoacs emacs.d
#+AUTHOR: Scott Astatine
#+PROPERTY:  header-args:emacs-lisp :tangle ~/.emacs.d/init.el :mkdirp yes

* Startup
** Garbage Collection config
#+begin_src emacs-lisp
;; -*- lexical-binding: t; -*-
;; The default is 800 kilobytes.  Measured in bytes.
(setq gc-cons-threshold (* 50 1000 1000))

;; Profile emacs startup
(add-hook 'emacs-startup-hook
          (lambda ()
            (message "*** Emacs loaded in %s seconds with %d garbage collections."
                     (emacs-init-time "%.2f")
                     gcs-done)))


#+end_src

** early-init.el
#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
;; -*- lexical-binding: t; -*-

(setq inhibit-startup-message t)
(setq native-comp-async-report-warnings-errors nil)
(setq package-native-compile t)
(scroll-bar-mode -1)
(tool-bar-mode -1)
(tooltip-mode -1)
(set-fringe-mode 10)

(menu-bar-mode -1)
(setq visible-bell nil)

(column-number-mode)
(global-display-line-numbers-mode t)
(menu-bar--display-line-numbers-mode-relative)

(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

#+end_src
** Normal stuff
#+begin_src emacs-lisp

  ;;; Line number config
(setq scroll-step 1)
(setq scroll-margin 2)
(dolist (mode '(term-mode-hook
                org-mode-hook
                helpful-mode-hook
                vterm-mode-hook
                ibuffer-mode-hook
                shell-mode-hook
                treemacs-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(setq pixel-scroll-precision-large-scroll-height 40.0)
(setq user-emacs-directory (expand-file-name "~/.emacs.d/.cache/")
      url-history-file (expand-file-name "url/history" user-emacs-directory))

#+end_src
** Native Compilation

#+begin_src emacs-lisp

;; Set the right directory to store the native comp cache
(add-to-list 'native-comp-eln-load-path (expand-file-name ".cache/eln-cache/" user-emacs-directory))


#+end_src
** Fonts Config

#+begin_src emacs-lisp
(defvar arko/default-font-size 90)

(set-face-attribute 'default nil :font "JetBrains Mono" :height arko/default-font-size)
(set-face-attribute 'fixed-pitch nil :font "JetBrains Mono" :height arko/default-font-size :weight 'regular)
(set-face-attribute 'variable-pitch nil :font "Julee" :height 132 :weight 'regular)
(variable-pitch-mode 1)

(custom-set-variables '(font-lock-support-mode 'tree-sitter-lock-mode))

#+end_src
** Org Mode Font
Font config for different headers in orgmode & more visual appearence thingy
#+begin_src emacs-lisp
(defun arko/org-font-setup ()
  ;; Replace list hyphen with dot
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

  ;; Set faces for heading levels
  (dolist (face '((org-level-1 . 1.3)
                  (org-level-2 . 1.14)
                  (org-level-3 . 1.07)
                  (org-level-4 . 1.04)
                  (org-level-5 . 1.02)
                  (org-level-6 . 1.02)
                  (org-level-7 . 1.02)
                  (org-level-8 . 1.02)))
    (set-face-attribute (car face) nil :font "JetBrains Mono" :weight 'regular :height (cdr face)))

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-table nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-verbatim nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))

#+end_src

* Package Management
** Package Manager Setup
#+begin_src emacs-lisp  
;; Initialize package sources
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

;; Initialize use-package on non-Linux platforms
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)

#+end_src
*** .emacs.d Management

#+begin_src emacs-lisp

(use-package no-littering)

(setq auto-save-file-name-transforms
      `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

#+end_src

** Projectile
#+begin_src emacs-lisp
(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :init
  (when (file-directory-p "~/Exploits")
    (setq projectile-project-search-path '("~/Exploits")))
  (setq projectile-switch-project-action #'projectile-dired))

(use-package counsel-projectile
  :config (counsel-projectile-mode))
(use-package treemacs-projectile)
#+end_src

** Magit
#+begin_src emacs-lisp

(use-package magit
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

;; (use-package evil-magit
;;   :after magit)

#+end_src

** Nerd Commenter
#+begin_src emacs-lisp

(use-package evil-nerd-commenter
    :bind ("C-/". evilnc-comment-or-uncomment-lines))

#+end_src
** AutoPair
#+begin_src emacs-lisp
(use-package phi-autopair
  :config
  (phi-autopair-global-mode))

#+end_src
#+begin_src emacs-lisp
;; (use-package forge)

#+end_src

** Ligatures
#+begin_src emacs-lisp
(use-package ligature
  :config
  ;; Enable the "www" ligature in every possible major mode
  (ligature-set-ligatures 't '("www"))
  ;; Enable traditional ligature support in eww-mode, if the
  ;; `variable-pitch' face supports it
  (ligature-set-ligatures 'eww-mode '("ff" "fi" "ffi"))
  ;; Enable all Cascadia Code ligatures in programming modes
  (ligature-set-ligatures 'prog-mode '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
                                       ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
                                       "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
                                       "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
                                       "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
                                       "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
                                       "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
                                       "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
                                       ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
                                       "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
                                       "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
                                       "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
                                       "\\\\" "://"))
  ;; Enables ligature checks globally in all buffers. You can also do it
  ;; per mode with `ligature-mode'.
  (global-ligature-mode t))
#+end_src
** Emojify
#+begin_src emacs-lisp

(use-package emojify
    :hook (after-init . global-emojify-mode))

#+end_src
* Keybinding
** WhichKey

#+begin_src emacs-lisp

  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.4))

#+end_src

** Evil-Mode
*** Evil
#+begin_src emacs-lisp
;; Emacs mode for following modes
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

(use-package evil
  :init
  (setq evil-want-integration t
        evil-want-keybinding nil
        evil-want-C-u-scroll t
        evil-want-C-d-scroll t
        evil-want-C-i-jump nil)

  :config
  (evil-mode 1)
  (setq evil-redo-function 'undo-redo)

  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
  (evil-global-set-key 'motion "L" 'next-buffer)
  (evil-global-set-key 'motion "H" 'previous-buffer)
  (evil-global-set-key 'motion "E" 'evil-end-of-visual-line)
  (evil-global-set-key 'motion ";" 'counsel-M-x)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))

(use-package evil-collection
  :after evil
  :ensure t
  :custom
  (evil-collection-setup-minibuffer t)
  :config
  (evil-collection-init))

(require 'treemacs-evil)

#+end_src
