init.el
;;   "Read a char.  If `k' then invoke `evil-normal-state'.  Else insert it."
;;   (interactive)
;;   (let ((ch  (read-char-exclusive)))
;;     (if (eq ?k ch)
;;         (evil-normal-state)
;;       (insert "j" (string ch)))))

;; (defun my-k ()
;;   "Read a char.  If `k' then invoke `evil-normal-state'.  Else insert it."
;;   (interactive)
;;   (let ((ch  (read-char-exclusive)))
;;     (if (eq ?j ch)
;;         (evil-normal-state)
;;       (insert "k" (string ch)))))

;; (global-set-key "j" 'my-j)
;; (global-set-key "k" 'my-k)

(use-package general)

(define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
(define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

(general-evil-setup)

(general-create-definer arko/leader-keys
  :keymaps '(normal visual emacs treemacs-mode eww-mode)
  :prefix "SPC")

;; First level Keymaps
(arko/leader-keys
  "tt" '(counsel-load-theme :which-key "choose theme")
  "p" '(projectile-command-map :which-key "Project")
  "w" '(evil-window-map :which-key "Window")

  "qq"'(save-buffers-kill-terminal :which-key "Exit Emacs")

  "e" '(treemacs-select-window :which-key "Treemacs Toggle"))

;; SPC f
(arko/leader-keys
  :prefix "SPC f"
  "s" '(save-buffer :which-key "Save Buffer")
  "o" '(counsel-find-file :which-key "Open File")
  "r" '(counsel-recentf :which-key "Open File"))

;; Code action keymaps
(arko/leader-keys
  :prefix "SPC c"
  "e" '(eval-last-sexp :which-key "Eval last sexp"))

;; SPC h
(arko/leader-keys
  :prefix "SPC h"
  "f" '(counsel-describe-function :which-key "Describe Function")
  "v" '(counsel-describe-variable :which-key "Describe Variable"))


;; SPC O
(arko/leader-keys
  :prefix "SPC o"
  "T" '(vterm :which-key "Open Term")
  "t" '(vterm-other-window :which-key "Open Term")
  "i" '(counsel-imenu :which-key "IMenu")
  "b" '(eww :which-key "eww")
  "e" '(eshell :which-key "Eshell"))

;; Orgmode
(defun org-run-code-block ()
  (interactive)
  (org-ctrl-c-ctrl-c)
  (org-display-inline-images))
(arko/leader-keys
  :prefix "SPC oo"
  "r" '(org-run-code-block :which-key "Run Code block")
  "v" '(org-display-inline-images :which-key "Display inline Images"))


(arko/leader-keys
  :prefix "SPC b"
  
  "l" '(evil-switch-to-windows-last-buffer :which-key "Kill Buffer")
  "k" '(kill-this-buffer :which-key "Kill Buffer")
  "f" '(counsel-switch-buffer :which-key "Switch Buffer")
  "d" '(kill-buffer :which-key "Find & Kill"))


(arko/leader-keys
  :prefix "SPC m" 
  "m" '(counsel-major :which-key "Major modes")
  "n" '(emms-next :which-key "Next")
  "s" '(emms-stop :which-key "Next")
  "h" '(emms-seek-backward :which-key "Seek backward")
  "l" '(emms-seek-forward :which-key "Seek forward")
  "j" '(emms-toggle-random-playlist :which-key "Sufftle")
  "d" '(emms-play-directory :which-key "Play the dir")
  "p" '(emms-play-directory :which-key "Play the dir")
  "p" '(emms-previous :which-key "Previous")
  "rt" '(emms-toggle-repeat-track :which-key "Repeat Track")
  "rp" '(emms-toggle-repeat-playlist :which-key "Repeat Playlist")
  "SPC" '(emms-pause :which-key "Play/Pause"))

(general-define-key
 :states 'motion
 "C-k" 'evil-scroll-line-up
 "C-j" 'evil-scroll-line-down)

(general-def 'normal emacs-lisp-mode-map 
  "K" 'elisp-slime-nav-describe-elisp-thing-at-point)

(general-def 'normal lsp-mode-map
  "K" 'lsp-describe-thing-at-point)

  (use-package hydra)

  (defhydra hydra-text-scale (:timeout 4)
    "scale text"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out")
    ("f" nil "finished" :exit t))

  (general-nmap
    :prefix "SPC"
    "ts" '(hydra-text-scale/body :which-key "scale text"))
  ;;

(use-package tree-sitter)
(use-package tree-sitter-langs)

(global-tree-sitter-mode)

  (use-package counsel
    :bind (("M-x" . counsel-M-x)
           ("C-x b" . counsel-ibuffer)
           ("C-x C-f" . counsel-find-file)
           :map minibuffer-local-map
           ("C-r" . 'counsel-minibuffer-history))
    :config
    (setq ivy-initial-inputs-alist nil)
    (setq counsel-describe-variable-function #'helpful-variable)
    (setq counsel-descbinds-function #'helpful-funciton))

(use-package ivy
    :diminish
    :bind (("C-s" . swiper)
        :map ivy-minibuffer-map
        ("RET" . ivy-alt-done)
        ("C-l" . ivy-alt-done)
        ("TAB" . ivy-next-line)
        ("C-j" . ivy-next-line)
        ("<backtab>" . ivy-previous-line)
        ("C-k" . ivy-previous-line)
        :map ivy-switch-buffer-map
        ("C-k" . ivy-previous-line)
        ("C-l" . ivy-done)
        ("C-d" . ivy-switch-buffer-kill)
        :map ivy-reverse-i-search-map
        ("C-k" . ivy-previous-line)
        ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1))

(use-package ivy-rich
    :init
    (ivy-rich-mode 1))

(use-package all-the-icons-ivy-rich
    :ensure t
    :init (all-the-icons-ivy-rich-mode 1))

;; Whether display the icons
(setq all-the-icons-ivy-rich-icon t)

;; Whether display the colorful icons.
;; It respects `all-the-icons-color-icons'.
(setq all-the-icons-ivy-rich-color-icon t)

;; The icon size
(setq all-the-icons-ivy-rich-icon-size 1.0)

;; Whether support project root
(setq all-the-icons-ivy-rich-project t)

;; Maximum truncation width of annotation fields.
;; This value is adjusted depending on the `window-width'.
(setq all-the-icons-ivy-rich-field-width 80)

;; Definitions for ivy-rich transformers.
;; See `ivy-rich-display-transformers-list' for details."
;; all-the-icons-ivy-rich-display-transformers-list

;; Slow Rendering
;; If you experience a slow down in performance when rendering multiple icons simultaneously,
;; you can try setting the following variable
(setq inhibit-compacting-font-caches t)

(use-package ivy-posframe
    :config
    (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-frame-center))
            ivy-posframe-min-width 130
            ivy-posframe-border-width 2
            ivy-posframe-max-height 30
            ivy-posframe-height 10
            ivy-posframe-max-width 220)
    (ivy-posframe-mode 1))

(use-package treemacs
  :init
  :config
  (setq treemacs-deferred-git-apply-delay        0.5
        treemacs-directory-name-transformer      #'identity
        treemacs-display-in-side-window          t
        treemacs-eldoc-display                   'simple
        treemacs-file-event-delay                5000
        treemacs-file-follow-delay               0.2
        treemacs-file-name-transformer           #'identity
        treemacs-follow-after-init               t
        treemacs-expand-after-init               t
        treemacs-is-never-other-window           nil
        treemacs-missing-project-action          'remove
        treemacs-move-forward-on-expand          nil
        treemacs-position                        'left
        treemacs-recenter-after-project-jump     'always
        treemacs-recenter-after-project-expand   'on-distance
        treemacs-litter-directories              '("/node_modules" "/.venv" "/.cask")
        treemacs-show-cursor                     nil
        treemacs-sorting                         'alphabetic-asc
        treemacs-select-when-already-in-treemacs 'move-back
        treemacs-space-between-root-nodes        t
        treemacs-tag-follow-cleanup              t
        treemacs-tag-follow-delay                0.5
        treemacs-wide-toggle-width               70
        treemacs-width                           35
        treemacs-width-increment                 1
        treemacs-workspace-switch-cleanup        nil))

(use-package treemacs-all-the-icons)
(treemacs-load-theme "all-the-icons")

(use-package all-the-icons
    :ensure t)
