Config.org
** Theme
#+begin_src emacs-lisp
(use-package all-the-icons
    :ensure t)

(use-package doom-themes
    :init (load-theme 'doom-outrun-electric t))

;; (use-package modus-themes)

#+end_src

** Doom Modeline

#+begin_src emacs-lisp
(use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1)
    :custom
    (doom-modeline-height 28))
#+end_src
** Rainbow
#+begin_src emacs-lisp
    (use-package rainbow-delimiters
      :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

** Helpful
#+begin_src emacs-lisp

(use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-funciton #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))


#+end_src

* Development
** Lsp Mode
#+begin_src emacs-lisp

(defun arko/lsp-mode-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols)))

(use-package lsp-mode
  :hook (lsp-mode . arko/lsp-mode-setup)
  :commands (lsp lsp-deferred)
  :init
  (setq lsp-keymap-prefix "C-l")
  :config
  (lsp-enable-which-key-integration t))

(use-package lsp-ui
  :after lsp-mode
  :config
  (lsp-ui-mode)
  (lsp-ui-doc-enable t)
  (setq lsp-ui-doc-delay 0.4
        lsp-ui-doc-position 'top
        lsp-ui-doc-max-height 12
        lsp-ui-doc-max-width 90
        lsp-ui-doc-show-with-cursor t
        lsp-ui-doc-show-with-mouse t))

(use-package lsp-ivy)


#+end_src
** DAP mode
#+begin_src emacs-lisp
(use-package dap-mode)
#+end_src
** Lsp-Treemacs
#+begin_src emacs-lisp

(use-package lsp-treemacs
    :after lsp)

#+end_src

** Company Mode
#+begin_src emacs-lisp
  (use-package company
      :bind
      (:map company-active-map
          ("<tab>" . company-complete-common-or-cycle)
          ("S-<tab>" . company-select-previous))
      (:map lsp-mode-map
          ("<tab>" . company-indent-or-complete-common)
          ("S-<tab>" . company-select-previous))
      :custom
      (company-minimum-prefix-length 1)
      (company-idle-delay 0.0))

  (global-company-mode)

  (use-package company-box
      :hook (company-mode . company-box-mode))

#+end_src

** Flycheck
#+begin_src emacs-lisp

(use-package flycheck
    :ensure t
    :init (global-flycheck-mode))

(add-hook 'after-init-hook #'global-flycheck-mode)

#+end_src

** Ripgrep
#+begin_src emacs-lisp
(use-package ripgrep)
#+end_src
** YaSnippet
#+begin_src emacs-lisp
(use-package yasnippet)
(yas-global-mode 1)
#+end_src
** Rust
#+begin_src emacs-lisp
(use-package rust-mode
  :ensure t
  :hook ((rust-mode . flycheck-mode)
	 (rust-mode . lsp-deferred))
  :config
  (setq rust-format-on-save t))

(add-hook 'rust-mode-hook
        (lambda () (setq indent-tabs-mode nil)))


#+end_src

** C/C++
#+begin_src emacs-lisp
(setq lsp-clangd-binary-path "/bin/clangd")
(add-hook 'c-mode-hook 'lsp)
(add-hook 'c++-mode-hook 'lsp)

(with-eval-after-load 'lsp-mode
  (require 'dap-cpptools))
  
#+end_src

** GLSL
#+begin_src emacs-lisp
(use-package glsl-mode)
#+end_src
** QML
#+begin_src emacs-lisp
(use-package qml-mode)
#+end_src
** Python
#+begin_src emacs-lisp
(use-package python-mode
  :ensure t
  :hook (python-mode . lsp-deferred))
#+end_src
** Jupyter
#+begin_src emacs-lisp
(use-package jupyter
  :ensure t)
(use-package ein)
(setq ein:output-area-inlined-images t
    ob-ein-inline-image-directory "~/.emacs.d/.cache/ob-ein-images")

#+end_src
** Elisp
#+begin_src emacs-lisp

(use-package highlight-defined)
(use-package lispy)
(use-package elisp-slime-nav)

#+end_src
** Slime
#+begin_src emacs-lisp
(use-package slime)
(setq inferior-lisp-program "sbcl")
#+end_src
** Lua
#+begin_src emacs-lisp
(use-package lua-mode)
#+end_src
** Nim
#+begin_src emacs-lisp
(use-package nim-mode
    :ensure t
    :hook (nim-mode . lsp))
#+end_src
** Typescript
#+begin_src emacs-lisp
(use-package typescript-mode
  :mode "\\.ts\\'"
  :hook (typescript-mode . lsp-deferred)
  :config
  (setq typescript-indent-level 2))

#+end_src
** Emmet
#+begin_src emacs-lisp
(use-package emmet-mode)
#+end_src
* Productivity
** VTerm
#+begin_src emacs-lisp

(use-package vterm
  :commands vterm
  :config
  (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")  ;; Set this to match your custom shell prompt
  ;;(setq vterm-shell "zsh")                       ;; Set this to customize the shell to launch
  (setq vterm-max-scrollback 10000))

#+end_src
** Emms
#+begin_src emacs-lisp
(use-package emms
    :config
    (emms-all)
    (emms-default-players)
    (setq emms-source-file-default-directory "~/Music"
            emms-info-functions '(emms-info-tinytag)
            emms-playlist-buffer-name "Music"
            emms-mode-line-icon-color "#2c2fe9"
            emms-mode-line-icon-enabled-p nil
            emms-volume-amixer-card 1
            emms-mode-line-format "🎶 "))

(require 'emms-player-simple)
(require 'emms-source-file)
(require 'emms-source-playlist)
(setq emms-player-list '(emms-player-mpg321
                        emms-player-ogg123
                        emms-player-mpv
                        emms-player-mplayer
                        ))


(defun track-title-from-file-name (file)
    (with-temp-buffer
    (save-excursion (insert (file-name-nondirectory (directory-file-name file))))
    (ignore-error 'search-failed
        (search-forward-regexp (rx "." (+ alnum) eol))
        (delete-region (match-beginning 0) (match-end 0)))
    (buffer-string)))

(defun my-emms-track-description (track)
    (let ((artist (emms-track-get track 'info-artist))
        (title (emms-track-get track 'info-title)))
    (cond ((and artist title)
            (concat artist " - " title))
            (title title)
            ((eq (emms-track-type track) 'file)
            (track-title-from-file-name (emms-track-name track)))
            (t (emms-track-simple-description track)))))

(setq emms-track-description-function 'my-emms-track-description)


(cond
 ;; test to see if D-Bus notifications are available
 ((if (and (require 'dbus nil t)
	   (dbus-ping :session "org.freedesktop.Notifications"))
      (progn
	(setq notify-method 'notify-via-dbus-notifications)
	(require 'notifications))))
 ;; could use the message system otherwise
 (t (setq notify-method 'notify-via-message)))

(defun notify-via-notifications (title msg icon)
  "Send notification with TITLE, MSG via `D-Bus'."
  (notifications-notify
   :title title
   :body msg
   :app-icon icon
   :urgency 'low))

(defun notify-via-messages (title msg)
  "Send notification with TITLE, MSG to message."
  (message "APPOINTMENT: %s" msg))

(defun emms-notifications-dbus (track-name)
  "Share track name via `D-Bus'."
  (let ((icon "/usr/share/icons/ePapirus-Dark/48x48/apps/multimedia.svg"))
    (notify-via-notifications "EMMS is now playing:" track-name icon)))

(defun emms-notifications-message (track-name)
  "Share track name via Emacs minibuffer."
  (message "EMMS is now playing: %s" track-name))

(setq emms-player-next-function 'emms-notify-and-next)

(defun emms-notify-and-next ()
  "Send a notification of track and start next."
  (emms-next-noerror)
  (let ((track-name (emms-track-description (emms-playlist-current-selected-track))))
    (cond
     ((eq notify-method 'notify-via-dbus-notifications)
      (emms-notifications-dbus track-name))
     (t (emms-notifications-message track-name)))))

#+end_src
