Config.org
** eww
#+begin_src emacs-lisp
(with-eval-after-load 'eww
  (setq-local endless/display-images t)
  (defun endless/toggle-image-display ()
    "Toggle images display on current buffer."
    (interactive)
    (setq endless/display-images
          (null endless/display-images))
    (endless/backup-display-property endless/display-images))

  (defun endless/backup-display-property (invert &optional object)
    "Move the 'display property at POS to 'display-backup.
     Only applies if display property is an image.
     If INVERT is non-nil, move from 'display-backup to 'display instead.
     Optional OBJECT specifies the string or buffer. Nil means current
     buffer."

    (let* ((inhibit-read-only t)
           (from (if invert 'display-backup 'display))
           (to (if invert 'display 'display-backup))
           (pos (point-min))
           left prop)
      (while (and pos (/= pos (point-max)))
        (if (get-text-property pos from object)
            (setq left pos)
          (setq left (next-single-property-change pos from object)))
        (if (or (null left) (= left (point-max)))
            (setq pos nil)
          (setq prop (get-text-property left from object))
          (setq pos (or (next-single-property-change left from object)
                        (point-max)))
          (when (eq (car prop) 'image)
            (add-text-properties left pos (list from nil to prop) object))))))


  (defun my/eww-toggle-images ()
    "Toggle whether images are loaded and reload the current page fro cache."
    (interactive)
    (setq-local shr-inhibit-images (not shr-inhibit-images))
    (eww-reload t)
    (message "Images are now %s"
             (if shr-inhibit-images "off" "on")))

  (define-key eww-mode-map (kbd "I") #'my/eww-toggle-images)
  (define-key eww-link-keymap (kbd "I") #'my/eww-toggle-images)

  ;; minimal rendering by default
  (setq-default shr-inhibit-images t)   ; toggle with `I`
  (setq-default shr-use-fonts nil))
#+end_src
** Pdf Mode
#+begin_src emacs-lisp
(use-package pdf-tools)

(when (eq major-mode 'pdf-view-mode)
  (setq display-line-numbers nil))

#+end_src
* Org Mode
#+begin_src emacs-lisp
  (defun arko/org-mode-setup ()
    (setq org-src-tab-acts-natively t
          org-src-tab-acts-natively     t
          org-src-preserve-indentation  t
          org-src-fontify-natively      t)
    (org-indent-mode)
    (visual-line-mode 1))

  (use-package org
    :hook (org-mode . arko/org-mode-setup)
    :config
    (setq org-ellipsis "👇"
          org-hide-emphasis-markers t
          org-agenda-files '("~/Exploits/docs/Tasks.org")
          org-agenda-start-with-log-mode t
          org-log-done 'time
          org-log-into-drawer t)

    (arko/org-font-setup))

  (defun arko/org-mode-visual-fill()
    (setq visual-fill-column-width 120
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . arko/org-mode-visual-fill))


#+end_src
** Org Bullets

#+begin_src emacs-lisp
  (use-package org-bullets
    :after org
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("🌩" "🚀" "✿" "✸" "●" "◉")))

#+end_src

** Org Babel
#+begin_src emacs-lisp

(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python . t)
   (jupyter . t)
   (ein . t)
   (julia . t)
   (lua . t)))

(setq org-startup-with-inline-images t)

(setq org-babel-default-header-args:jupyter-python '((:async . "yes")
                                                     (:session . "python")
                                                     (:kernel . "python3")))

(setq org-babel-default-header-args:ein-python '((:session . "localhost:8888/emacsnotebook.ipynb")))


(require 'org-tempo)
(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("ein" . "src ein"))
(add-to-list 'org-structure-template-alist '("jbp" . "src jupyter-python"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("jl" . "src julia"))

(setq org-confirm-babel-evaluate nil)

(push '("conf-unix" . conf-unix) org-src-lang-modes)

#+end_src

** Org Drill

#+begin_src emacs-lisp

(use-package org-drill)

#+end_src

** Auto tangle Config file
#+begin_src emacs-lisp

(defun arko/org-babel-tangle-config ()
  (interactive)
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/.emacs.d/Config.org"))
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'arko/org-babel-tangle-config)))

#+end_src
